Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/refugee_status_and_leave_to_remain/education_for_refugees.html.txt.tmx
Source language: en
Languages: ga

source: Education for people with refugee status or subsidiary protection or permission to remain
ga: Oideachas do dhaoine le stádas dídeanaí nó cosanta coimhdí nó le cead fanachta

source: All children and young people, including those granted international protection (refugee status or subsidiary protection) or permission to remain are entitled to free primary and post-primary education
ga: Tá gach leanbh agus duine óg, lena n-áirítear iad ar bhronntar cosaint idirnáisiúnta (stádas dídeanaí nó cosanta coimhdí) nó cead fanachta, i dteidil bhunoideachais agus iar-bhunoideachais saor in aisce

source: People who have been granted refugee or subsidiary protection status have the right to access education and training in the like manner and to the like extent in all respects as an Irish citizen
ga: Tá an ceart chun rochtain ar oideachas agus oiliúint ar an mbealach céanna agus ar a mhéad céanna i ngach gné le saoránach Éireannach ag daoin a bhronntar stádas dídeanaí nó cosanta coimhdí

source: While it is not set out in legislation, people given humanitarian leave to remain in the State are normally conferred with most of the same rights and privileges, including the right to education, as those conferred on refugees
ga: Cé nach leagtar amach sa reachtaíocht í, bronntar na cearta agus na pribhléidí céanna ar dhaoine ar tugadh cead daonnúil chun fanacht sa Stát dóibh, lena n-áirítear an ceart chun oideachais agus a bhronntar ar dhídeanaithe

source: You can read more about the Irish education system in this guide to living independently for people who have been granted refugee status or subsidiary protection or permission to remain (pdf)
ga: Is féidir léigh tuilleadh faoin chóras oideachais na hÉireann sa treoir um maireachtáil neamhspleách (pdf) do dhaoine a bhronntar stádas dídeanaí nó cosaint choimhdeach nó cead fanacht dóibh

source: Early childhood education generally means education before the start of formal schooling
ga: Ciallaíonn luathoideachas don óige, go ginearálta, an t-oideachas a fhaigheann leanaí sula gcuirtear tús le scolaíocht fhoirmiúil

source: It covers the period from birth to 6 years
ga: Cumhdaíonn sé an tréimhse ó bhreith an linbh go dtí aois 6 bliana

source: It is available in pre-schools, playgroups and daycare services
ga: Tá sé ar fáil i réamhscoileanna, naíonraí agus seirbhísí cúram lae

source: The Early Childhood Care and Education (ECCE) programme gives children access to a limited amount of free care and education before they start school
ga: Soláthraíonn an clár Cúraim agus Oideachais Luath-Óige (COLÓ) rochtain do mhéid teoranta chúraim agus oideachais luath-óige saor in aisce do leanaí sula dtosaínn siad ar scoil

source: All children are required to be educated from the age of 6 to 16 (or until they have completed 3 years of second-level education)
ga: Ní mór do gach leanbh fanacht ar scoil nó go bhfuil 16 bliain d’aois sroichte acu (nó go bhfuil 3 bliana oideachais iar-bhunscoile críochnaithe acu)

source: On completing primary education, the students then transfer to post-primary (second-level) education
ga: Ar chríochnú an oideachais bhunscolaíochta dóibh, aistríonn na daltaí go hiar-bhunoideachas (nó oideachas dara leibhéal)

source: They join the Junior Cycle of secondary education, which lasts 3 years
ga: Glacann siad páirt i dTimthriall Sóisearach na meánscolaíochta, a mhaireann ar feadh 3 bliana

source: At the end of this cycle, students present themselves for the Junior Certificate Examination
ga: Ag deireadh an timthriaill seo, cuireann na daltaí iad féin i láthair do Scrúdú an Teastais Shóisearaigh

source: Students then continue into the Senior Cycle, which lasts 2 or 3 years and leads to students presenting for the Leaving Certificate Examination
ga: Leanann na daltaí ar aghaidh chuig an Timthriall Sinsearach ansin, a mhaireann ar feadh dhá nó trí bliana agus óna gcuireann na daltaí iad féin i láthair do scrúdú na hArdteistiméireachta

source: Children with special educational needs because of a disability get extra support either in their own school or in special schools
ga: Gheobhaidh leanaí a bhfuil riachtanais speisialta oideachais acu mar gheall ar mhíchumas tacaíocht bhreise ina gcuid scoil nó i scoileanna speisialta

source: Corporal punishment is prohibited in Irish schools
ga: Tá cosc ar phíonós corpartha i scoileanna na hÉireann

source: There are extra resources in schools for non-English-speaking children
ga: Tá tacaíochta breise ag scoileanna do leanái nach cainteoirí Béarla iad

source: Children may have free access to mother tongue supports
ga: Féadann rochtain shaor in aisce a bheith ag leanaí ar thacaíochtaí máthairtheanga

source: Adults may have access to English language classes and to adult literacy which are provided by the local Education and Training Board (ETB)
ga: Féadann rochtai a bheith ag daoine fásta ar ranganna Béarla agus litearthachta do dhaoine fásta a sholáthróidh an Bord Oideachais agus Oiliúna (BOO) áitiúil

source: The availability and duration of these classes is decided by the local ETB
ga: (Ó 1 Iúil 2013, cuireadh Boird Oideachais agus Oiliúna in áit coistí gairmoideachais.) Cinneann an BOO áitiúil fáil agus fad na ranganna seo

source: People with refugee status or subsidiary protection, with humanitarian leave to remain or leave to remain as the parents of an Irish-born child can access approved PLC courses
ga: Tá daoine le stádas dídeanaí nó cosanta coimhdí, iad a gnóthaigh cead daonnúil fanachta agus daoine a dtugtar cead fanachta faoi Scéim um Leanaí a Rugadh in Éirinn i dteidil rochtain ar chúrsaí IAT ceadaithe

source: They may also participate in the Vocational Training Opportunities Scheme (VTOS) provided they meet the normal VTOS requirements
ga: Má tá siad cáilithe, is féidir leo páirt a ghlacadh sa Scéim Deiseanna Oiliúna Gairmoideachais

source: You can read more about access to further education courses for non-EU nationals here
ga: Léigh tuilleadh eolais maidir le rochtain ar chursaí breisoideachas do náisiúnaigh neamh-AE anseo (pdf)

source: People with refugee status or subsidiary protection and those with humanitarian leave to remain are entitled to free third-level (university or college) education if they have been living in Ireland for 3 years or more
ga: Má bíonn daoine le stádas dídeanaí nó cosanta coimhdí agus daoine a gnóthaigh cead daonnúil fanachta in a gcónaí in Éirinn ar feadh 3 bhliain nó níos mó, beidh siad i dteidil oideachas tríú leibhéal (ollscoil nó coláiste) saor in aisce

source: They also may be entitled to third level maintenance grants
ga: D'fheadfaí bheith i dteidil deontais chothabhála tríú leibhéal

source: Information about their entitlement to free fees is on studentfinance.ie
ga: Tá tuilleadh eolais maidir le a dteidlíocht táillí saor in aisce ar an suíomh gréasáin, studentfinance.ie

source: Those with leave to remain as parents of an Irish-born child are not entitled to free fees or maintenance grants
ga: Níl daoine a dtugtar cead fanachta faoi Scéim um Leanaí a Rugadh in Éirinn i dteidil táillí saor in aisce nó deontais chothabhála
